In [1]:
import numpy as np 
import pandas as pd 
PREVIOUS_MAX_ROWS = pd.options.display.max_rows 
pd.options.display.max_rows = 20 
np.random.seed(12345)

In [2]:
import matplotlib.pyplot as plt 
plt.rc('figure', figsize=(10, 6)) 
np.set_printoptions(precision=4, suppress=True)

In [4]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data[0] = None 
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [6]:
from numpy import nan as NA 
data = pd.Series([1, NA, 3.5, NA, 7]) 
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],  [NA, NA, NA], [NA, 6.5, 3.]]) 
cleaned = data.dropna()

In [9]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [10]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [11]:
data.dropna(how='all') 
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [12]:
data[4] = NA 
data 
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [18]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA 
df.iloc[:2, 2] = NA 
df 
df.dropna() 
df.dropna(thresh=2)

          0         1         2
2  0.523772       NaN  1.343810
3 -0.713544       NaN -2.370232
4 -1.860761 -0.860757  0.560145
5 -1.265934  0.119827 -1.063512
6  0.332883 -2.359419 -0.199543

In [19]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.476985  0.500000  0.000000
1 -0.577087  0.500000  0.000000
2  0.523772  0.500000  1.343810
3 -0.713544  0.500000 -2.370232
4 -1.860761 -0.860757  0.560145
5 -1.265934  0.119827 -1.063512
6  0.332883 -2.359419 -0.199543

In [20]:
df.fillna(0, inplace=True)

In [21]:
df

          0         1         2
0  0.476985  0.000000  0.000000
1 -0.577087  0.000000  0.000000
2  0.523772  0.000000  1.343810
3 -0.713544  0.000000 -2.370232
4 -1.860761 -0.860757  0.560145
5 -1.265934  0.119827 -1.063512
6  0.332883 -2.359419 -0.199543

In [22]:
df = pd.DataFrame(np.random.randn(6, 3)) 
df.iloc[2:, 1] = NA 
df.iloc[4:, 2] = NA 
df 
df.fillna(method='ffill') 
df.fillna(method='ffill', limit=2)

          0         1         2
0 -1.541996 -0.970736 -1.307030
1  0.286350  0.377984 -0.753887
2  0.331286  0.377984  0.069877
3  0.246674  0.377984  1.004812
4  1.327195       NaN  1.004812
5  0.022185       NaN  1.004812

In [23]:
data = pd.Series([1., NA, 3.5, NA, 7]) 
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [24]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],  'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [25]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [26]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [27]:
data['v1'] = range(7) 
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [28]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [29]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',  'Pastrami', 'corned beef', 'Bacon',  'pastrami', 'honey ham', 'nova lox'],  'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [30]:
meat_to_animal = { 
'bacon': 'pig', 
'pulled pork': 'pig', 
'pastrami': 'cow', 
'corned beef': 'cow', 
'honey ham': 'pig', 
'nova lox': 'salmon' 
}

In [32]:
lowercased = data['food'].str.lower() 
lowercased 
data['animal'] = lowercased.map(meat_to_animal) 
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [33]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [34]:
data = pd.Series([1., -999., 2., -999., -1000., 3.]) 
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [35]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [36]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [37]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [38]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [39]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),  index=['Ohio', 'Colorado', 'New York'],  columns=['one', 'two', 'three', 'four'])

In [40]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [41]:
transform = lambda x: x[:4].upper() 
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [42]:
data.index = data.index.map(transform) 
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [43]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [44]:
data.rename(index={'OHIO': 'INDIANA'},  columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [45]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True) 
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [46]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32] 

bins = [18, 25, 35, 60, 100] 
cats = pd.cut(ages, bins) 
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [47]:
cats.codes 
cats.categories 
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [48]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [50]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior'] 
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [51]:
data = np.random.rand(20) 
pd.cut(data, 4, precision=2)

[(0.32, 0.53], (0.74, 0.95], (0.74, 0.95], (0.53, 0.74], (0.11, 0.32], ..., (0.74, 0.95], (0.11, 0.32], (0.74, 0.95], (0.32, 0.53], (0.74, 0.95]]
Length: 20
Categories (4, interval[float64]): [(0.11, 0.32] < (0.32, 0.53] < (0.53, 0.74] < (0.74, 0.95]]

In [52]:
data = np.random.randn(1000) # Normally distributed 
cats = pd.qcut(data, 4) # Cut into quartiles 
cats 
pd.value_counts(cats)

(0.613, 3.928]                   250
(-0.0321, 0.613]                 250
(-0.686, -0.0321]                250
(-2.9499999999999997, -0.686]    250
dtype: int64

In [53]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-1.187, -0.0321], (-1.187, -0.0321], (-1.187, -0.0321], (-0.0321, 1.287], (-0.0321, 1.287], ..., (1.287, 3.928], (-2.9499999999999997, -1.187], (-1.187, -0.0321], (-0.0321, 1.287], (-1.187, -0.0321]]
Length: 1000
Categories (4, interval[float64]): [(-2.9499999999999997, -1.187] < (-1.187, -0.0321] < (-0.0321, 1.287] < (1.287, 3.928]]

In [55]:
data = pd.DataFrame(np.random.randn(1000, 4)) 
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.047439     0.046069     0.024366    -0.006350
std       0.997187     0.998359     1.008925     0.993665
min      -3.428254    -3.645860    -3.184377    -3.745356
25%      -0.743886    -0.599807    -0.612162    -0.697084
50%      -0.086309     0.043663    -0.013609    -0.026381
75%       0.624413     0.746527     0.690847     0.694459
max       3.366626     2.653656     3.525865     2.735527

In [56]:
col = data[2] 
col[np.abs(col) > 3]

55     3.260383
230   -3.056990
317   -3.184377
777    3.525865
Name: 2, dtype: float64

In [57]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
36  -2.315555  0.457246 -0.025907 -3.399312
55   0.050188  1.951312  3.260383  0.963301
131  0.146326  0.508391 -0.196713 -3.745356
230 -0.293333 -0.242459 -3.056990  1.918403
254 -3.428254 -0.296336 -0.439938 -0.867165
317  0.275144  1.179227 -3.184377  1.369891
539 -0.362528 -3.548824  1.553205 -2.186301
631  3.366626 -2.372214  0.851010  1.332846
777 -0.658090 -0.207434  3.525865  0.283070
798  0.599947 -3.645860  0.255475 -0.549574

In [58]:
data[np.abs(data) > 3] = np.sign(data) * 3 
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.047378     0.047263     0.023821    -0.005206
std       0.994634     0.994342     1.005685     0.989845
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.743886    -0.599807    -0.612162    -0.697084
50%      -0.086309     0.043663    -0.013609    -0.026381
75%       0.624413     0.746527     0.690847     0.694459
max       3.000000     2.653656     3.000000     2.735527

In [59]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0 -1.0  1.0
1 -1.0  1.0 -1.0  1.0
2 -1.0 -1.0 -1.0 -1.0
3 -1.0  1.0  1.0 -1.0
4  1.0  1.0  1.0 -1.0

In [60]:
import numpy as np 
import pandas as pd 
pd.options.display.max_rows = 20 
np.random.seed(12345) 
import matplotlib.pyplot as plt 
plt.rc('figure', figsize=(10, 6)) 
np.set_printoptions(precision=4, suppress=True)

In [61]:
data = pd.Series(np.random.randn(9), 
 index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],  [1, 2, 3, 1, 3, 1, 2, 2, 3]]) 
data

a  1   -0.204708
   2    0.478943
   3   -0.519439
b  1   -0.555730
   3    1.965781
c  1    1.393406
   2    0.092908
d  2    0.281746
   3    0.769023
dtype: float64

In [62]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [ ]:
data['b'] 
data['b':'c'] 
data.loc[['b', 'd']]

In [ ]:
data.loc[:, 2]

In [ ]:
data.unstack()

In [ ]:
data.unstack().stack()

In [ ]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)), 
 index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]], 
 columns=[['Ohio', 'Ohio', 'Colorado'], 
 ['Green', 'Red', 'Green']]) 
frame

In [ ]:



In [99]: 
frame.index.names = ['key1', 'key2'] 
frame.columns.names = ['state', 'color'] 
frame 

In [100]: 
frame['Ohio'] 


In [101]: 
frame.swaplevel('key1', 'key2') 


In [102]: 
frame.sort_index(level=1) 
frame.swaplevel(0, 1).sort_index(level=0)